In [3]:
import pandas as pd
import numpy as np

In [18]:
arr=np.random.randint(1,100,(3,3))

df = pd.DataFrame(arr, columns=["A","B","C"], index = ["X","y","z"])

df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [19]:
df.describe()

               A          B          C
count   3.000000   3.000000   3.000000
mean   30.666667  52.333333  44.333333
std    24.193663  30.072135  36.295087
min    12.000000  18.000000  11.000000
25%    17.000000  41.500000  25.000000
50%    22.000000  65.000000  39.000000
75%    40.000000  69.500000  61.000000
max    58.000000  74.000000  83.000000

In [20]:
df

    A   B   C
X  22  74  83
y  12  18  11
z  58  65  39

In [23]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [24]:
df['A'].unique()

array([22, 12, 58])

In [25]:
df.shape

(3, 3)

In [26]:
df.size

9

In [32]:
df1=pd.read_csv('./Data/concrete.csv')

df1.head()

   cement   slag  ash  water  superplastic  coarseagg  fineagg  age  strength
0   540.0    0.0  0.0  162.0           2.5     1040.0    676.0   28     79.99
1   540.0    0.0  0.0  162.0           2.5     1055.0    676.0   28     61.89
2   332.5  142.5  0.0  228.0           0.0      932.0    594.0  270     40.27
3   332.5  142.5  0.0  228.0           0.0      932.0    594.0  365     41.05
4   198.6  132.4  0.0  192.0           0.0      978.4    825.5  360     44.30

In [33]:
df1.sample(10)

,cement,slag,ash,water,superplastic,coarseagg,fineagg,age,strength
656,200.0,133.0,0.0,192.0,0.0,965.4,806.2,3,11.41
887,326.0,0.0,138.0,199.0,11.0,801.0,792.0,28,40.68
944,153.1,145.0,113.0,178.5,8.0,1001.9,688.7,28,25.56
959,312.9,160.5,0.0,177.6,9.6,916.6,759.5,28,52.45
522,284.0,15.0,141.0,179.0,5.5,842.0,801.0,56,44.52
977,313.3,145.0,0.0,178.5,8.0,1001.9,688.7,28,41.05
364,214.9,53.8,121.9,155.6,9.6,1014.3,780.6,3,18.02
982,312.7,0.0,0.0,178.1,8.0,999.7,822.2,28,25.10
426,173.8,93.4,159.9,172.3,9.7,1007.2,746.6,14,29.55
892,273.0,0.0,90.0,199.0,11.0,931.0,762.0,28,32.24

In [56]:
#df1.index = df1["slag"]

coffee=pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/master/warmup-data/coffee.csv')

coffee.head

<bound method NDFrame.head of           Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35>

In [57]:
coffee.loc[1,"Units Sold"] = 10

coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [60]:
coffee.Day
print("\n\n")

coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [ ]:
import seaborn as sns